tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "kubecolor/tap"
tap "schniz/tap"
tap "tabbyml/tabby"
brew "libtiff"
brew "little-cms2"
brew "webp"
brew "jpeg-xl"
brew "autoconf"
brew "automake"
brew "awscli"
brew "cloudflared"
brew "cmake"
brew "libevent"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "libssh"
brew "qemu"
brew "lima"
brew "colima"
brew "coreutils"
brew "docker"
brew "entr"
brew "gcc"
brew "leptonica"
brew "libarchive"
brew "numpy", link: false
brew "srt"
brew "tesseract"
brew "ffmpeg"
brew "fnm"
brew "fzf"
brew "libavif"
brew "gd"
brew "git-delta"
brew "git-lfs"
brew "gnu-getopt"
brew "gnu-sed"
brew "gnupg"
brew "gojq"
brew "netpbm"
brew "gts"
brew "librsvg"
brew "libtool"
brew "graphviz"
brew "helm"
brew "htop"
brew "jsonnet-bundler"
brew "just"
brew "k9s"
brew "llvm", link: true
brew "neovim"
brew "openjdk"
brew "openssl@1.1"
brew "opentofu"
brew "poetry"
brew "protobuf"
brew "protobuf@3"
brew "pyenv"
brew "redis@6.2"
brew "stow"
brew "tanka"
brew "the_silver_searcher"
brew "tmux"
brew "tree"
brew "watch"
brew "wget"
brew "zlib"
brew "zsh"
brew "hashicorp/tap/terraform-ls"
brew "kubecolor/tap/kubecolor"
brew "tabbyml/tabby/tabby"
cask "aerial"
cask "amethyst"
cask "brave-browser"
cask "font-fira-code"
cask "font-jetbrains-mono"
cask "karabiner-elements"
cask "keepassxc"
cask "kitty"
cask "libreoffice"
cask "miro"
cask "notion"
cask "obsidian"
cask "postman"
cask "reaper"
cask "sensiblesidebuttons"
cask "slack"
cask "spotify"
cask "the-unarchiver"
cask "utm"
cask "whatsapp"
