tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "schniz/tap"
brew "awscli"
brew "cmake"
brew "cocoapods"
brew "coreutils"
brew "entr"
brew "exercism"
brew "fzf"
brew "git-review"
brew "gnu-sed"
brew "gnupg"
brew "go"
brew "gor"
brew "gzip"
brew "helm"
brew "htop"
brew "ios-deploy"
brew "jq"
brew "kubernetes-cli"
brew "kubectx"
brew "mr"
brew "mysql-client"
brew "packer"
brew "pandoc"
brew "pipenv"
brew "pyenv"
brew "rename"
brew "ruby"
brew "sbt"
brew "stow"
brew "telnet"
brew "terraform"
brew "the_silver_searcher"
brew "tldr"
brew "tmux"
brew "vim"
brew "watch"
brew "watchman"
brew "wget"
brew "yarn"
brew "zsh"
brew "schniz/tap/fnm"
cask "aerial"
cask "amethyst"
cask "calibre"
cask "darktable"
cask "dash"
cask "discord"
cask "docker"
cask "dropbox"
cask "firefox"
cask "font-fira-code"
cask "gimp"
cask "google-chrome"
cask "graphiql"
cask "insomnia"
cask "intellij-idea-ce"
cask "iterm2"
cask "java"
cask "karabiner-elements"
cask "keepassx"
cask "keepingyouawake"
cask "keeweb"
cask "libreoffice"
cask "musescore"
cask "ngrok"
cask "nvidia-geforce-now"
cask "postman"
cask "reaper"
cask "slack"
cask "spotify"
cask "steam"
cask "sublime-text"
cask "transmission"
cask "tuxguitar"
cask "vagrant"
cask "virtualbox"
cask "virtualbox-extension-pack"
cask "visual-studio-code"
cask "whatsapp"
cask "wireshark"
